Repository: VoTanThanhlaptrinh/cellphones_clone
Catalog: cellPhoneS_backend/Resources/ShareResource.*.resx
Languages: vi

# PhoneRequired
source: Phone number is required.
vi: Số điện thoại là bắt buộc.

# PasswordRequired
source: Password is required.
vi: Mật khẩu là bắt buộc.

# BirthDayRequired
source: Date of birth is required.
vi: Ngày sinh là bắt buộc.

# FullNameRequired
source: Full name is required.
vi: Họ và tên là bắt buộc.

# MaxName
source: Name must not exceed the maximum length.
vi: Tên không được vượt quá độ dài tối đa.

# Phone10Digit
source: Phone number must be 10 digits.
vi: Số điện thoại phải có 10 chữ số.

# ConfirmPasswordRequired
source: Confirm password is required.
vi: Xác nhận mật khẩu là bắt buộc.

# MinPassword
source: Password must meet the minimum length requirement.
vi: Mật khẩu phải đạt độ dài tối thiểu.

# PasswordNotMatchRequired
source: Password and confirm password do not match.
vi: Mật khẩu và Xác nhận mật khẩu không khớp.

# TypeUserRequired
source: Please select a user type.
vi: Vui lòng chọn loại người dùng.

# TypeSchoolRequired
source: Please select a school type.
vi: Vui lòng chọn loại trường học.

# NameSchoolRequired
source: School name is required.
vi: Tên trường học là bắt buộc.

# IdStudentRequired
source: Student ID is required.
vi: Mã sinh viên là bắt buộc.

# IdTeacherRequired
source: Teacher ID is required.
vi: Mã giáo viên là bắt buộc.

# NameInCardRequired
source: Name on card is required.
vi: Tên in trên thẻ là bắt buộc.

# ExpiredDateCardRequired
source: Card expiration date is required.
vi: Ngày hết hạn của thẻ là bắt buộc.

# ExpiredDateMustBeTodayOrFuture
source: Expiration date must be today or in the future.
vi: Ngày hết hạn của thẻ phải là hôm nay hoặc trong tương lai.

# EmailRequired
source: Email is required.
vi: Email là bắt buộc.

# EmailInvalid
source: Email format is invalid.
vi: Email không đúng định dạng.

# EmailSchoolInvalid
source: School email must use a .edu domain (e.g., .edu, .edu.vn).
vi: Email trường phải thuộc tên miền .edu (ví dụ: .edu, .edu.vn).

# FrontFaceCardRequired
source: Please upload the front side of the card.
vi: Vui lòng tải ảnh mặt trước của thẻ.

# BehindFaceCardRequired
source: Please upload the back side of the card.
vi: Vui lòng tải ảnh mặt sau của thẻ.

# FileExceed2Mb
source: File size must not exceed 2 MB.
vi: Kích thước tệp không được vượt quá 2 MB.

# ProductNameRequired
source: Product name is required.
vi: Tên sản phẩm là bắt buộc.

# ProductNameMaxLength
source: Product name must not exceed 255 characters.
vi: Tên sản phẩm không được vượt quá 255 ký tự.

# BasePriceMustBeGreaterOrEqualZero
source: Base price must be greater than or equal to 0.
vi: Giá gốc phải lớn hơn hoặc bằng 0.

# SalePriceMustBeGreaterOrEqualZero
source: Sale price must be greater than or equal to 0.
vi: Giá khuyến mãi phải lớn hơn hoặc bằng 0.

# VersionMaxLength
source: Version must not exceed 255 characters.
vi: Phiên bản không được vượt quá 255 ký tự.

# StatusMaxLength
source: Status must not exceed 50 characters.
vi: Trạng thái không được vượt quá 50 ký tự.

# CategoryIdMustBeGreaterThanZero
source: Category ID must be greater than 0.
vi: Category ID phải lớn hơn 0.

# BrandIdMustBeGreaterThanZero
source: Brand ID must be greater than 0.
vi: Brand ID phải lớn hơn 0.

# CommitmentNotEmpty
source: Commitment must not be empty.
vi: Cam kết không được để trống.

# CommitmentNotWhiteSpace
source: Commitment must not contain only whitespace.
vi: Cam kết không được chỉ chứa khoảng trắng.

# SpecificationNameRequired
source: Specification name is required.
vi: Tên thông số là bắt buộc.

# SpecificationNameMaxLength
source: Specification name must not exceed 255 characters.
vi: Tên thông số không được vượt quá 255 ký tự.

# SpecificationDetailsRequired
source: Specification details are required.
vi: Danh sách chi tiết thông số là bắt buộc.

# SpecificationDetailsMustHaveAtLeastOne
source: There must be at least one specification detail.
vi: Phải có ít nhất một chi tiết thông số.

# SpecificationDetailNameRequired
source: Specification detail name is required.
vi: Tên chi tiết thông số là bắt buộc.

# SpecificationDetailNameMaxLength
source: Specification detail name must not exceed 255 characters.
vi: Tên chi tiết thông số không được vượt quá 255 ký tự.

# SpecificationDetailValueRequired
source: Specification detail value is required.
vi: Giá trị chi tiết thông số là bắt buộc.

# SpecificationDetailValueMaxLength
source: Specification detail value must not exceed 1000 characters.
vi: Giá trị chi tiết thông số không được vượt quá 1000 ký tự.

# ImageOriginUrlRequired
source: Image URL is required.
vi: Đường dẫn hình ảnh là bắt buộc.

# ImageOriginUrlMaxLength
source: Image URL must not exceed 1000 characters.
vi: Đường dẫn hình ảnh không được vượt quá 1000 ký tự.

# ImageOriginUrlInvalid
source: Image URL format is invalid.
vi: Định dạng đường dẫn hình ảnh không hợp lệ.

# ImageMimeTypeRequired
source: Image MIME type is required.
vi: Kiểu MIME của hình ảnh là bắt buộc.

# ImageMimeTypeMaxLength
source: Image MIME type must not exceed 100 characters.
vi: Kiểu MIME của hình ảnh không được vượt quá 100 ký tự.

# ImageNameRequired
source: Image name is required.
vi: Tên hình ảnh là bắt buộc.

# ImageNameMaxLength
source: Image name must not exceed 255 characters.
vi: Tên hình ảnh không được vượt quá 255 ký tự.

# ImageAltRequired
source: Image alt text is required.
vi: Văn bản mô tả (alt) của hình ảnh là bắt buộc.

# ImageAltMaxLength
source: Image alt text must not exceed 255 characters.
vi: Văn bản mô tả (alt) của hình ảnh không được vượt quá 255 ký tự.
